## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:84" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:84" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a6df88339a61a70317eddf8e032cd8ace6770e7feb866934e3d8af86d6313815" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:73fafdcef0f0bcfc76aa6c9a27bcebde771be2360c84bda8ad134ce237d97426"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 84 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "0603923bf51900b3ccf4f930b3d340f0-6" -> "938984eea36f7f37854f599588f82097"
        id                     = "graphql.938984eea36f7f37854f599588f82097.zip"
        tags                   = {}
      ~ version_id             = "SF4n4ugh15URhzy1Qxwu0NOPNlk.8IbI" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = "tfF7S0zgt4MncUpbKEefEQHlzjO9_0WG" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.8b161ff4421a6ccdaaff062300182b6f.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9b8e39b01699bce2bfd4ca209f5c6a99-4" -> "05613e696d08543460473722a2b8b445"
      ~ id                     = "python.8b161ff4421a6ccdaaff062300182b6f.zip" -> (known after apply)
      ~ key                    = "python.8b161ff4421a6ccdaaff062300182b6f.zip" -> "python.05613e696d08543460473722a2b8b445.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "8b161ff4421a6ccdaaff062300182b6f" -> "05613e696d08543460473722a2b8b445"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "UjdI.9kENl0Mu8UUvGFSjqVHw..ZfbGO" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "12131e8a4ae67edc24aad5b35d3c77d5" -> "24bb719656946a164f72d0010b12e679"
        id                     = "dist/200.html"
      ~ source_hash            = "12131e8a4ae67edc24aad5b35d3c77d5" -> "24bb719656946a164f72d0010b12e679"
        tags                   = {}
      ~ version_id             = "KZF9fKYKZFw4JMZ81OPL7aDxyHADXNEP" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "63b67310c99e2a2c8ecffe94af70f7c3" -> "4c17106d8937d50b99a7d4fe76e40225"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "63b67310c99e2a2c8ecffe94af70f7c3" -> "4c17106d8937d50b99a7d4fe76e40225"
        tags                   = {}
      ~ version_id             = "9qGrINYkvkzXGMGyLpRhIPVcGmudoR86" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "266855b3e89d0b35cec2c3d7ea6abf0c" -> "9da71b0a9d5d57a911f8cd9a576a7825"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "266855b3e89d0b35cec2c3d7ea6abf0c" -> "9da71b0a9d5d57a911f8cd9a576a7825"
        tags                   = {}
      ~ version_id             = "hNmd9r8U08mnj6ALxjWU32GYkpu49O9U" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "12131e8a4ae67edc24aad5b35d3c77d5" -> "24bb719656946a164f72d0010b12e679"
        id                     = "dist/index.html"
      ~ source_hash            = "12131e8a4ae67edc24aad5b35d3c77d5" -> "24bb719656946a164f72d0010b12e679"
        tags                   = {}
      ~ version_id             = "iIMkddieO33nG9W_xN0M54KYWAe1KEVz" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.7b9620fc.chunk.js"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.7b9620fc.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f883ba0d22a3404c78ebc4c218c564dd" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js" -> null
-       source_hash            = "f883ba0d22a3404c78ebc4c218c564dd" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "DGqrzmUuSPDch9GssuQ2aBsMaX5qP361" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.7b9620fc.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.7b9620fc.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.7b9620fc.chunk.js.LICENSE.txt" -> null
-       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "mENWeb9ap30WdydypJob.v95yL59pr5O" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.bf6e696e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "51635af00c9a26b1f9892de818959cee"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js"
+       source_hash            = "51635af00c9a26b1f9892de818959cee"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.bf6e696e.chunk.js.LICENSE.txt"
+       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.07826217.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.07826217.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadNewUploadPage.07826217.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "bdaddac5668063212c68d8a178206c65" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.07826217.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.07826217.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.07826217.chunk.js" -> null
-       source_hash            = "bdaddac5668063212c68d8a178206c65" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "TBHsvko0ODMFNaKGFzF3aD_qh7eE2Wv0" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.07826217.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.07826217.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadNewUploadPage.07826217.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "cc27fa172211f2877b50629ac7228a71" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.07826217.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.07826217.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.07826217.chunk.js.LICENSE.txt" -> null
-       source_hash            = "cc27fa172211f2877b50629ac7228a71" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "QoioDPZ3Abu0cYdIVYfFMEvgcu_7xRaz" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c60caf40.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "9495b3dee576dda5103e036739c951b9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.c60caf40.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c60caf40.chunk.js"
+       source_hash            = "9495b3dee576dda5103e036739c951b9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c60caf40.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.4f5cc337.js"] will be destroyed
  # (because key ["static/js/app.4f5cc337.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.4f5cc337.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8720645c102e0127ea92f5a5f765204f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.4f5cc337.js" -> null
-       key                    = "dist/static/js/app.4f5cc337.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.4f5cc337.js" -> null
-       source_hash            = "8720645c102e0127ea92f5a5f765204f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nHf0TEenUCGoIzjXIRAxGkGGHtmrQm3d" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.4f5cc337.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.4f5cc337.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.4f5cc337.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.4f5cc337.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.4f5cc337.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.4f5cc337.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "7FY5lJODTFt7y6NPbjc4o7jQuJKFlRRs" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.16ef45e6.js"] will be destroyed
  # (because key ["static/js/runtime-app.16ef45e6.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/runtime-app.16ef45e6.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "20936cba1833b6f28a52dabdef21a6c8" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.16ef45e6.js" -> null
-       key                    = "dist/static/js/runtime-app.16ef45e6.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.16ef45e6.js" -> null
-       source_hash            = "20936cba1833b6f28a52dabdef21a6c8" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "hQCLtD7MQrcXCf.XzIwo0xfUzOfpewZp" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.ad9e1ce3.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "038c465487bde88aebc28f6c9a876b95"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.ad9e1ce3.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.ad9e1ce3.js"
+       source_hash            = "038c465487bde88aebc28f6c9a876b95"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-10T20:02:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:51/invocations" -> (known after apply)
      ~ s3_key                         = "python.8b161ff4421a6ccdaaff062300182b6f.zip" -> "python.05613e696d08543460473722a2b8b445.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "219bd900ca8f3811f1386c252b5374782cb5a8b2" -> "9a910b51da4ad30b28ff3346bab7d4fa6abe923b"
              ~ "DD_TAGS"                      = "git.commit.sha:219bd900ca8f3811f1386c252b5374782cb5a8b2,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:9a910b51da4ad30b28ff3346bab7d4fa6abe923b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "219bd900ca8f3811f1386c252b5374782cb5a8b2" -> "9a910b51da4ad30b28ff3346bab7d4fa6abe923b"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:99" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:99/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "99" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "219bd900ca8f3811f1386c252b5374782cb5a8b2" -> "9a910b51da4ad30b28ff3346bab7d4fa6abe923b"
              ~ "DD_TAGS"                            = "git.commit.sha:219bd900ca8f3811f1386c252b5374782cb5a8b2,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:9a910b51da4ad30b28ff3346bab7d4fa6abe923b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "219bd900ca8f3811f1386c252b5374782cb5a8b2" -> "9a910b51da4ad30b28ff3346bab7d4fa6abe923b"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "99" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:7/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "219bd900ca8f3811f1386c252b5374782cb5a8b2" -> "9a910b51da4ad30b28ff3346bab7d4fa6abe923b"
              ~ "DD_TAGS"                      = "git.commit.sha:219bd900ca8f3811f1386c252b5374782cb5a8b2,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:9a910b51da4ad30b28ff3346bab7d4fa6abe923b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "219bd900ca8f3811f1386c252b5374782cb5a8b2" -> "9a910b51da4ad30b28ff3346bab7d4fa6abe923b"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 10 to change, 12 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8649141591)*